**`nomis-development`** terraform plan on `pull_request` event [#3370](https://github.com/ministryofjustice/modernisation-platform-environments/actions/runs/4262720176)

```
Terraform will perform the following actions:

  # aws_sns_topic.nomis_nonprod_alarms will be created
  + resource "aws_sns_topic" "nomis_nonprod_alarms" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "nomis_nonprod_alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
